; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared0 - mode
	image2 - mode
	spectrograph5 - mode
	image4 - mode
	infrared1 - mode
	thermograph3 - mode
	Star3 - direction
	Star4 - direction
	Star6 - direction
	Star7 - direction
	Star0 - direction
	Star1 - direction
	GroundStation2 - direction
	GroundStation5 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 infrared1)
	(supports instrument0 image2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared1)
	(supports instrument1 image4)
	(supports instrument1 spectrograph5)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
)
(:goal (and
	(have_image Phenomenon8 spectrograph5)
	(have_image Phenomenon9 image2)
	(have_image Phenomenon9 image4)
	(have_image Phenomenon10 spectrograph5)
	(have_image Phenomenon10 image2)
	(have_image Star11 spectrograph5)
	(have_image Star12 image4)
	(have_image Star13 thermograph3)
	(have_image Star13 image2)
	(have_image Phenomenon14 spectrograph5)
	(have_image Phenomenon14 infrared0)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 11
2. (calibrate satellite0 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 0 of 11
3. (turn_to satellite0 phenomenon9 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 phenomenon9)
   goals met: 0 of 11
4. (take_image satellite0 phenomenon9 instrument1 image4)
   added: (have_image phenomenon9 image4)
   goals met: 1 of 11
5. (turn_to satellite0 phenomenon8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon8)
   goals met: 1 of 11
6. (take_image satellite0 phenomenon8 instrument1 spectrograph5)
   added: (have_image phenomenon8 spectrograph5)
   goals met: 2 of 11
7. (turn_to satellite0 phenomenon14 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 11
8. (take_image satellite0 phenomenon14 instrument1 spectrograph5)
   added: (have_image phenomenon14 spectrograph5)
   goals met: 3 of 11
9. (turn_to satellite0 phenomenon10 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 11
10. (take_image satellite0 phenomenon10 instrument1 spectrograph5)
   added: (have_image phenomenon10 spectrograph5)
   goals met: 4 of 11
11. (turn_to satellite0 star11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star11)
   goals met: 4 of 11
12. (take_image satellite0 star11 instrument1 spectrograph5)
   added: (have_image star11 spectrograph5)
   goals met: 5 of 11
13. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 5 of 11
14. (take_image satellite0 star12 instrument1 image4)
   added: (have_image star12 image4)
   goals met: 6 of 11
15. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 6 of 11
16. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 6 of 11
17. (turn_to satellite0 star0 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star0)
   goals met: 6 of 11
18. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 6 of 11
19. (turn_to satellite0 phenomenon10 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon10)
   goals met: 6 of 11
20. (take_image satellite0 phenomenon10 instrument0 image2)
   added: (have_image phenomenon10 image2)
   goals met: 7 of 11
21. (turn_to satellite0 phenomenon14 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon14)
   goals met: 7 of 11
22. (take_image satellite0 phenomenon14 instrument0 infrared0)
   added: (have_image phenomenon14 infrared0)
   goals met: 8 of 11
23. (turn_to satellite0 phenomenon9 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon9)
   goals met: 8 of 11
24. (take_image satellite0 phenomenon9 instrument0 image2)
   added: (have_image phenomenon9 image2)
   goals met: 9 of 11
25. (turn_to satellite0 star13 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star13)
   goals met: 9 of 11
26. (take_image satellite0 star13 instrument0 image2)
   added: (have_image star13 image2)
   goals met: 10 of 11
27. (take_image satellite0 star13 instrument0 thermograph3)
   added: (have_image star13 thermograph3)
   goals met: 11 of 11
